# GetOpeningLoops Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..GetOpeningLoops Method
AnalyticalModelSurface Class See Also
---
Retrieves Array of CurveLoops of Analytical Surface Opening.. Only valid openings for hide are allowed.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<CurveLoop> GetOpeningLoops(
	ElementId openingId
)
```

Visual Basic
---
```text
Public Function GetOpeningLoops ( _
	openingId As ElementId _
) As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetOpeningLoops(
	ElementId^ openingId
)
```

# ### Parameters
openingId
    Type: Autodesk.Revit.DB..::..ElementId Identifies which Opening creates the CurveLoop in the analytical surface.
# ### Return Value
Array of CurveLoops associated with Opening.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | openingId is invalid for Analytical Model Surface. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace